import{j as s,G as i,B as e}from"./index-5OtMV-3S.js";const r=`
Название рецепта (опционально)
Группа продукта (опционально)
Ингредиент 1 кг
Ингредиент2 2л
Группа2 (опционально)
Ингредиент3 3кг

Рецепт на 7 порций
---
Разделитель - только "-=#~" символы
Описание рецепта в свободной форме
###
Остальные разделители игнорируются
`,h=`Маффины с капустой и грудинкой

яйца - 3 штук
соли - 1 ч.л.
кефира - 4 ст.л.
растительного масла - 1 ст.л.
муки - 3 ст.л.
разрыхлителя - 1 ч.л.
молодой капусты - 300 г

7 порций

###
Ставим выпекаться в предварительно разогретую до 200 градусов духовку на 20 минут.
https://ovkuse.ru/recipes/13004041
`;function n(){return s.jsx("main",{children:s.jsxs("div",{className:"about",children:[s.jsx("h1",{children:"О проекте"}),s.jsx("p",{children:"Цель проекта - упростить адаптацию рецептов под конкретные задачи"}),s.jsx("p",{children:"Основной сценарий - когда есть рецепт с ютуба/других источников простым текстом, и очень часто бывает так что количество порций слишком много/мало или в холодильнике лежит только определенное количество основного продукта"}),s.jsx("p",{children:"Так же актуально для различного рода заготовок, когда нужно рецептуру пересчитать под необходимый объем"}),s.jsx("p",{children:"Основные функции калькулятора:"}),s.jsxs("ul",{children:[s.jsx("li",{children:"Разбор текстового рецепта"}),s.jsx("li",{children:"Пересчет количества порций от заявленного в рецепте количества"}),s.jsx("li",{children:"Пересчет по основному продукту"}),s.jsx("li",{children:"Пересчет концентрации уксуса"}),s.jsx("li",{children:"Конвертация единиц измерения"}),s.jsx("li",{children:"При наличии возможности пересчет из объема в массу и обратно"}),s.jsx("li",{children:"Отметка списка зачеркнутым (для того чтобы не запутаться в том положили ли какой то ингредиент или нет)"})]}),s.jsx("h2",{children:"Формат текстового рецепта"}),s.jsx("b",{children:"Структура рецепта"}),s.jsx("pre",{children:r}),s.jsx("b",{children:"Пример:"}),s.jsx("pre",{children:h}),s.jsx("h2",{children:"Предупреждение"}),s.jsx("p",{children:"Автор не несет ответственности за любые ошибки связанные с калькулятором и рецептами. Используйте на свой страх и риск, перепроверяйте результаты вычислений и вот это все"}),s.jsx("p",{children:"Данный интерфейс находится на стадии MVP и в дальнейшем может быть сильно изменен"}),s.jsx("h2",{children:"Обратная связь"}),s.jsxs("p",{children:["Сообщения о ошибках отправляйте в"," ",s.jsx("a",{href:"https://github.com/Apkawa/food_recipe_manager/issues",children:"github issues"})]}),s.jsx("h2",{children:"Лицензия"}),s.jsx("p",{children:"Проект распространяется по лицензии MIT"}),s.jsx("p",{children:s.jsx("a",{href:"https://github.com/Apkawa/food_recipe_manager",children:"Github"})}),s.jsx("div",{children:s.jsx(i,{})}),s.jsx(e,{})]})})}export{n as default};
